{
  "shadowticket": {
    "title": "Shadow Ticket",
    "day_read": "11/21/2025",
    "author": "Thomas Pynchon", 
    "stars": "4",
    "review": "Old man Pynchon leans perhaps heaviest into his goofiness with this one- ever name more absurd than the last, a ton of songs (including a peanut butter jelly time reference), and all sorts of his usual absurdity, including teleporting Hungarians, acronyms that spell SMEGMA, a lamp so tasteless that it breaks cameras (and has been extolled in Tasteless Lamp Quarterly), and the central plot conceit of the book being that a PI is chasing down a cheese heiress, the daughter of the Al Capone of cheese.\n Beyond the gags there’s plenty of the other typical Pynchonisms- intelligence agencies everywhere, corporate consolidation swallowing up everything in its wake (including, it turns out the Al Capone of cheese), and a world on the brink of something- in this case, fascism in Europe, and possibly in America. Hicks’ uncle admire Hitler from afar in Milwaukee and hangs with his boys at a pro-Nazi bowling alley where nobody really bowls, and fascist gangs are roving the countryside. A woman runs towards her fate as an anarchist saint in Spain, golems retrieve mistakenly identified as Jews from camps of fascists (Harley Davidson has to be a Jewish bike because Davidson, you see), and clarinetists scour the European countryside for safe places to shuttle Jews if it comes to it. In case you thought he meant this was a European problem, he throws in a half page dalliance at the end to bring you back to the States, towards our homegrown fascism. Pynchon takes a moment, also towards the end, to do a little aside, to look at the reader and bring you to your own present moment, to what you are doing: he asks, quite literally, will you bury your head in the sand, start a family, buy a house, keep your head down, ignoring what goes on around you, until the regret swallows you? And then he says no one is around to hear it anymore. It is a stunning bit of audience work, after he spends much of his time in Hungary/Europe doing his usual deluge of characters and setpieces, to bring it back to something direct and digestible and in such a gut punching way. \nI also found the ending pretty stunning, as perhaps the final piece of writing (although hopefully not!) he puts out. In a letter from a teen informant of Hicks, he shows perhaps a glimmer of hope, or something similar- the youth in revival, in search of something golden at the end of the rainbow in California, where so many Pynchon books land, the innocence and hope always in spring somewhere even if you’re laden with the responsibility of having to fight, too world weary to go looking for it, or too old to do anything but look back on the past. “Maybe they’ll keep finding new ways to be innocent,” chasing sunsets in California, the dream lives on. If this is the end, then it’s about as good as a way to go out, but maybe we’ll see one more sunset and we can turn to Tommy P for advice (or at least a laugh) one last time."
  }, 
  "savingtime": {
    "title": "Saving Time: Discovering a Life Beyond the Clock", 
    "day_read": "12/1/2025",
    "author": "Jenny Odell",
    "stars": "3",
    "review": "Happy to spend more time in Odell’s head after really loving How To Do Nothing but this one ultimately falls short of that work. I was fully in for about half of it- you start elaborating on birds, the origins of wage labor, quoting Southland Tales, I Think you Should Leave and Georges Perec and you got me nailed down to a T- but it feels like she didn’t quite stick the landing all the way (even if I liked the ending). Perhaps there’s no way to satisfying get to the bottom of time and our relationship to it, but it felt worse than that- it feels like she got lost in her own disparate connections, somewhat lost sight of the old goal. Perhaps the simple thesis of How To Do Nothing helped make all the navigating feel more guided. In some ways, this feels like the opposite of something I noted about Animal Vegetable Miracle, which was unapologetically a time capsule of some of the haughtiness of Bush-era liberalism- this one approaches some of its points timidly, seeking out possible criticisms before they can land, trying to cover every possible interest group before they can object to the book and losing the ability to make actual arguments and substance because of it.\nThat being said, I think this book has a lot to actually say, just as her last book did. The history of Taylorism and selling your time- the origins of wage labor and contemporary obsessions with workplace efficiencies, the subject of capital trying to account for the productivity of every moment (whether imposed by actual all-seeing systems or just an imagined panopticon). Her resistance to the idea of history as the result of inevitable forces, the engagement with the present as where change can occur, negating the bound to have happened past and the bound to happen future (even if I found some of her scholarship and reference work lacking that could’ve helped her build it out). The disconnection from the seasons (easy to say as a Bay Area writer) that leads to all time feeling the same. In the end, what she proposes is a sort of anti-productivity, or perhaps better worded an anti-efficiency; she’s not against work, but she is against the obsession with efficiency, with making sure every second reaches the maximum amount of efficiency. Instead, she searches to linger in moments, to watch the passing of the seasons, to make time for the differently abled and for work to be done in its own time rather than as quickly as possible. It’s a utopian vision, and not one I always feel like she does the best job showcasing here, but it’s a nice one to visit nonetheless."
  },
  "lightness": {
    "title": "The Unbearable Lightness of Being", 
    "day_read": "11/28/2025",
    "stars": "2",
    "review": "As overwrought as it gets- every bit of actual novel (aka character, plot or scenery) has to be interrupted by 5 bits of Kundera’s philosophizing or theorizing. Not poetic enough to be poetry, not of real substance in actual thinking about politics, mostly aphoristic when it comes to philosophy, one wonders if Kundera picked up novel writing just because it was the easiest place to pull the wool over people’s eyes. End of History as novel- all it must be soes, the world as inevitable, all choices and actions predetermined, all attempts to change things self-martyring, attention seeking, or otherwise ill-founded. Occasionally strikes an interesting chord with one of the digressions but only because it play so many notes (and when it does, it usually stretches it far longer than warranted)."
  }
}
